app/Http/Controllers/TaskController.php

select * from `tasks` order by `created_at` desc
---
    public function index()
    {
        return Task::latest()->get();

update `tasks` set `completed` = '1', `tasks`.`updated_at` = '2021-07-11 17:04:52' where `id` = 16
---
    public function update(Request $request, $id)
    {
        $task = Task::findOrFail($id);
        $task->update($request->all());

delete from `tasks` where `id` = 21
select * from `tasks` order by `created_at` desc
---
    public function destroy($id)
    {
        $task = Task::findOrFail($id);
        $task->delete();
        return Task::latest()->get();